import java.util.Scanner;

public class W4 {

	public static void main(String[] args) {
		/*1. 두개의 정수를 입력받아 큰수와 작은수, 합계와 평균 구하기❤️
		    (🚨평균은 소수점 첫째자리까지 출력해주세요!!)
		*/
		Scanner input = new Scanner(System.in);
		System.out.println("두 수를 입력하시오");
		int a=input.nextInt();
		int b=input.nextInt();
		double avg= (a*b)/2;
		
		
		System.out.println("평균: "+ Math.round(avg)); 


		
		
		/*
		2. 0~100사이의 정수를 하나 입력받고 60점 이상이면 "합격", 60점 미만이면 "불합격", 
		   범위외에 정수를 입력하면 "숫자를 잘못 입력하셨습니다."를 출력해주세용😊
		*/
		
		
		
		
		
		/*
		3. 이름과 점수를 입력받아 점수에 따른 성적구하기🤔
		   (90점이상 = A, 80점이상 = B, 70점이상 = C, 60점이상 = D, 그 외 = F)
		*/
	}

}
